# Current Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontTableIterator..::..Current Property
ExportFontTableIterator Class See Also
---
Gets the item at the current position of the iterator.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual KeyValuePair<ExportFontKey, ExportFontInfo> Current { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Current As KeyValuePair(Of ExportFontKey, ExportFontInfo)
	Get
```

Visual C++
---
```text
public:
virtual property KeyValuePair<ExportFontKey^, ExportFontInfo^> Current {
	KeyValuePair<ExportFontKey^, ExportFontInfo^> get ();
}
```

# ### Implements
IEnumerator<(Of <(<'T>)>)>..::..Current
# Remarks
There is no current item if the iterator has not started yet or has been done.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
ExportFontTableIterator Class
Autodesk.Revit.DB Namespace